In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'ID': [1, 2, 3],
                    'Nombre': ['Ana', 'Luis', 'Carlos']})
df2 = pd.DataFrame({'ID': [1, 2, 4],
                    'Edad': [25, 30, 22]})

df1

In [4]:
df2

   ID  Edad
0   1    25
1   2    30
2   4    22

En algunos casos nos vamos a topar que nuestros DataFrames vengan de lugares diferentes y tengamos que juntarlos, esto se puede resolver de diferentes maneras, en este caso usaremos merge, donde la primer tabla que se describe se alinea a la izquierda y se usa on para establecer en base a que columna se hace la union de los datos

In [5]:
df_combinado = pd.merge(df1, df2, on='ID')
df_combinado

   ID Nombre  Edad
0   1    Ana    25
1   2   Luis    30

Al fusionar ambos dataframes perdimos algunos datos esto es por el parametro **how** ya que por default esta como **inner** que sirve para solo fusionar los datos que si se encuentran en ambas tablas, pero no solo exite inner, tambien esta **outer**, **left** y **right**

outer: junta todos los datos y los que no encuentra los define como NaN
left: junta los datos segun la tabla de la izquierda
right: junta los datos segun la tabla de la derecha

In [8]:
df_combinado = pd.merge(df1, df2, on='ID', how='outer')
df_combinado

   ID  Nombre  Edad
0   1     Ana  25.0
1   2    Luis  30.0
2   3  Carlos   NaN
3   4     NaN  22.0

Ademas existe una forma de fusionar todos los datos sin que se pierda la informaci√≥n usando left_index y right_index

In [9]:
df_indexado = pd.merge(df1, df2, left_index=True, right_index=True)
df_indexado

   ID_x  Nombre  ID_y  Edad
0     1     Ana     1    25
1     2    Luis     2    30
2     3  Carlos     4    22